% =========================================================================
% 功能：计算球Bessel函数的微分
% -------------------------------------------------------------------------
% 输入
%	n	--- order
%		---	dimension: 不超过1维
%	z	--- argument；可以是复数；dimension: 必须是0维
% -------------------------------------------------------------------------
% 输出
%	dj	--- 球Bessel函数的微分；维度与n相同
% =========================================================================
function jd = SphBessel1D(max_order, z, varargin)

    z_row = z(:).';

	j = SphBessel1((0:max_order+1).', z_row);

	n = (0:max_order).';
	jd = zeros(max_order+1, length(z_row));
	jd = n./z_row .* j(1:end-1,:) - j(2:end,:);

    jd = reshape(jd, size(n.*z));
end
